---
type: ExternalResourceUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# ExternalResourceUtils

`Autodesk.Revit.DB.ExternalResourceUtils` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAllExternalResourceReferences | — | `` |